# U.S. Medical Insurance Costs

<h3>Get imports and initial setup</h3>

In [1]:
# Import Pandas Library
import pandas as pd

In [2]:
# Read in data csv file via pandas and store it into a dataframe
df = pd.read_csv("insurance.csv")

In [3]:
# Print out data frame
df

      age     sex     bmi  children smoker     region      charges
0      19  female  27.900         0    yes  southwest  16884.92400
1      18    male  33.770         1     no  southeast   1725.55230
2      28    male  33.000         3     no  southeast   4449.46200
3      33    male  22.705         0     no  northwest  21984.47061
4      32    male  28.880         0     no  northwest   3866.85520
...   ...     ...     ...       ...    ...        ...          ...
1333   50    male  30.970         3     no  northwest  10600.54830
1334   18  female  31.920         0     no  northeast   2205.98080
1335   18  female  36.850         0     no  southeast   1629.83350
1336   21  female  25.800         0     no  southwest   2007.94500
1337   61  female  29.070         0    yes  northwest  29141.36030

[1338 rows x 7 columns]

<h2>Get statistical data</h2>

In [4]:
# Get the basic statitics for charges
df["charges"].describe()

count     1338.000000
mean     13270.422265
std      12110.011237
min       1121.873900
25%       4740.287150
50%       9382.033000
75%      16639.912515
max      63770.428010
Name: charges, dtype: float64

<h3>Get the mean for each catagory for their average costs</h3>

In [5]:
# Get mean (average) charges for age
df[["age", "charges"]].mean()

age           39.207025
charges    13270.422265
dtype: float64

In [6]:
# Get mean (average) charges by sex
df[["sex", "charges"]].groupby("sex").mean()

             charges
sex
female  12569.578844
male    13956.751178

In [7]:
# Get mean (average) charges by number of children
df[["children", "charges"]].groupby("children").mean()

               charges
children
0         12365.975602
1         12731.171832
2         15073.563734
3         15355.318367
4         13850.656311
5          8786.035247

In [8]:
# Get mean (average) charges by smokers (yes or no)
df[["smoker", "charges"]].groupby("smoker").mean()

             charges
smoker
no       8434.268298
yes     32050.231832

In [9]:
# Get mean (average) charges by region
df[["region", "charges"]].groupby("region").mean()

                charges
region
northeast  13406.384516
northwest  12417.575374
southeast  14735.411438
southwest  12346.937377

In [10]:
#End Program